meeting/minutes/2026/03-03.org
*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2493][#2493]]: 2408 Misc editorial corrections
+ PR [[https://qt4cg.org/dashboard/#pr-2485][#2485]]: 2388 Adaptive serialization of anonymous functions
+ PR [[https://qt4cg.org/dashboard/#pr-2480][#2480]]: 2465 Improve description of FODC0006
+ PR [[https://qt4cg.org/dashboard/#pr-2479][#2479]]: 2472 drop the term "potential visibility"
+ PR [[https://qt4cg.org/dashboard/#pr-2469][#2469]]: 2466 Adapt rules of format-number to new comparison rules
+ PR [[https://qt4cg.org/dashboard/#pr-2468][#2468]]: 2448 Change title of XPath 4.0 specification

Proposal: merge without discussion.

Accepted.

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2018][#2018]]: Type-checking the result of xsl:apply-templates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1702][#1702]]: Node Updates: Functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1506][#1506]]: Type declarations: Constructor functions?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1251][#1251]]: Allow sequence constructor in extension instructions that are implemented with named templates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1225][#1225]]: Generalization of Deep Updates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/641][#641]]: Serialization fallback

Proposal: close with no further action.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2492][#2492]]: 2052 fn:collation-available: $usage
+ PR [[https://qt4cg.org/dashboard/#pr-2491][#2491]]: 2484 Subtyping: abstract types vs choice types
+ PR [[https://qt4cg.org/dashboard/#pr-2490][#2490]]: 2443 Naming: JNodes, selectors and contents
+ PR [[https://qt4cg.org/dashboard/#pr-2483][#2483]]: 1479 XQuery: Default Namespace Clarifications
+ PR [[https://qt4cg.org/dashboard/#pr-2481][#2481]]: 1528 ambiguities in computed node constructors
+ PR [[https://qt4cg.org/dashboard/#pr-2479][#2479]]: 2472 drop the term "potential visibility"
+ PR [[https://qt4cg.org/dashboard/#pr-2478][#2478]]: 2476 guaranteed streamability
+ PR [[https://qt4cg.org/dashboard/#pr-2474][#2474]]: 272 Allow xsl:use-package to set parameters
+ PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]]: 1310 Functions fn:regex and ?matching-substrings
+ PR [[https://qt4cg.org/dashboard/#pr-2467][#2467]]: Harmonize the fn: and file: functions that read text
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2313][#2313]]: 2298 XQFO rules: definition of default values
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2467: Harmonize the fn: and file: functions that read text
:PROPERTIES:
:CUSTOM_ID: pr-2467
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2467][#2467]]

I think the high-order question here is, do we want to add fallback to the
text functions, or leave them alone and add it to ~bin:decode-string~?

NW attempts to outline the situation.

+ MK: It’s generally true that if you use off-the-shelf decoding libraries, it’s
  hard to catch decoding errors.
+ CG: I agree. It could be hard to do this properly.
+ NW: There are three options…no, only on text, or on both text and ~bin:decode-string~f
+ CG: We have permitted characters now.
+ RD: Should we do what decode libraries do and insert a fallback character?
+ MK: Is it meaningful to distinguish failure to decode from having a character that isn’t permitted?
+ NW: I think we’re talking about unpermitted characters.
+ JK: One other model to consider is instead of using a fallback function using a filter.

Straw poll: fallback function or fallback character?

In favor of a function: 1, in favor of a character: 2.

+ RD: It appears that ICU allows a callback. https://unicode-org.github.io/icu/userguide/conversion/converters.html#error-callbacks
  + … We should do some more investigation.

+ NW: Let’s stop there and I’ll see what I can do about some research. This
  isn’t worth spending the whole call on.

** PR #2470: 1310 Functions fn:regex and ?matching-substrings
:PROPERTIES:
:CUSTOM_ID: pr-2470
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]]

+ MK: This proposal does two things which might have been a mistake based on comments.
  + … In effect there’s a new function “matching substrings” that gives you more
    detail about the things that you matched.
+ ML: The other thing it does is to make all the regex functions available as
  methods on a regex object; there’s a function ~fn:regex~ that returns a record
  with functions as its members. That allows you to call matches, replace, etc.
  as “methods”.
  + … That makes it easier for the user to indicate that the compiled expression
    should be cached for reuse.
+ MK: I’m interested in discussion; we should probably separate those.
+ NW: I’m a little worried about the proliferation of using records as pseudo-objects.
+ CG: I think adding the regex object is a bit redundant and may confuse users.
  + … Regex isn’t too complex so you can use things like an LRU cache of the compiled objects.
  + … It seems to me that there are harder things in the language to cache.
+ JK: The motivating user story came from Liam Quin. Any word from him?
+ MK: I think he indicated that matching-substrings exceeded his requirements.
+ CG: I really like that function.
+ MK: What I’ll do is progress matching-substrings as a free standing function
  and I’ll consider making fn:regex a separate proposal.
+ WP: Does this fall into a class of such problems that are solvable by record structures?
+ RD: The issue is caching the parsed regex object.

