meeting/minutes/2026/03-03.html
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2493">#2493</a>: 2408 Misc editorial corrections</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2485">#2485</a>: 2388 Adaptive serialization of anonymous functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2480">#2480</a>: 2465 Improve description of FODC0006</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2479">#2479</a>: 2472 drop the term "potential visibility"</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2469">#2469</a>: 2466 Adapt rules of format-number to new comparison rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2468">#2468</a>: 2448 Change title of XPath 4.0 specification</li>
</ul>

<p>
Proposal: merge without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2018">#2018</a>: Type-checking the result of xsl:apply-templates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1702">#1702</a>: Node Updates: Functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1506">#1506</a>: Type declarations: Constructor functions?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1251">#1251</a>: Allow sequence constructor in extension instructions that are implemented with named templates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1225">#1225</a>: Generalization of Deep Updates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/641">#641</a>: Serialization fallback</li>
</ul>

<p>
Proposal: close with no further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2492">#2492</a>: 2052 fn:collation-available: $usage</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2491">#2491</a>: 2484 Subtyping: abstract types vs choice types</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2490">#2490</a>: 2443 Naming: JNodes, selectors and contents</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2483">#2483</a>: 1479 XQuery: Default Namespace Clarifications</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2481">#2481</a>: 1528 ambiguities in computed node constructors</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2479">#2479</a>: 2472 drop the term "potential visibility"</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2478">#2478</a>: 2476 guaranteed streamability</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2474">#2474</a>: 272 Allow xsl:use-package to set parameters</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>: 1310 Functions fn:regex and ?matching-substrings</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2467">#2467</a>: Harmonize the fn: and file: functions that read text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2313">#2313</a>: 2298 XQFO rules: definition of default values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2467" class="outline-3">
<h3 id="pr-2467"><span class="section-number-3">2.1.</span> PR #2467: Harmonize the fn: and file: functions that read text</h3>
<div class="outline-text-3" id="text-pr-2467">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2467">#2467</a>
</p>

<p>
I think the high-order question here is, do we want to add fallback to the
text functions, or leave them alone and add it to <code>bin:decode-string</code>?
</p>

<p>
NW attempts to outline the situation.
</p>

<ul class="org-ul">
<li>MK: It’s generally true that if you use off-the-shelf decoding libraries, it’s
hard to catch decoding errors.</li>
<li>CG: I agree. It could be hard to do this properly.</li>
<li>NW: There are three options…no, only on text, or on both text and ~bin:decode-string~f</li>
<li>CG: We have permitted characters now.</li>
<li>RD: Should we do what decode libraries do and insert a fallback character?</li>
<li>MK: Is it meaningful to distinguish failure to decode from having a character that isn’t permitted?</li>
<li>NW: I think we’re talking about unpermitted characters.</li>
<li>JK: One other model to consider is instead of using a fallback function using a filter.</li>
</ul>

<p>
Straw poll: fallback function or fallback character?
</p>

<p>
In favor of a function: 1, in favor of a character: 2.
</p>

<ul class="org-ul">
<li>RD: It appears that ICU allows a callback. <a href="https://unicode-org.github.io/icu/userguide/conversion/converters.html#error-callbacks">https://unicode-org.github.io/icu/userguide/conversion/converters.html#error-callbacks</a>
<ul class="org-ul">
<li>… We should do some more investigation.</li>
</ul></li>

<li>NW: Let’s stop there and I’ll see what I can do about some research. This
isn’t worth spending the whole call on.</li>
</ul>
</div>
</div>
<div id="outline-container-pr-2470" class="outline-3">
<h3 id="pr-2470"><span class="section-number-3">2.2.</span> PR #2470: 1310 Functions fn:regex and ?matching-substrings</h3>
<div class="outline-text-3" id="text-pr-2470">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>
</p>

<ul class="org-ul">
<li>MK: This proposal does two things which might have been a mistake based on comments.
<ul class="org-ul">
<li>… In effect there’s a new function “matching substrings” that gives you more
detail about the things that you matched.</li>
</ul></li>
<li>ML: The other thing it does is to make all the regex functions available as
methods on a regex object; there’s a function <code>fn:regex</code> that returns a record
with functions as its members. That allows you to call matches, replace, etc.
as “methods”.
<ul class="org-ul">
<li>… That makes it easier for the user to indicate that the compiled expression
should be cached for reuse.</li>
</ul></li>
<li>MK: I’m interested in discussion; we should probably separate those.</li>
<li>NW: I’m a little worried about the proliferation of using records as pseudo-objects.</li>
<li>CG: I think adding the regex object is a bit redundant and may confuse users.
<ul class="org-ul">
<li>… Regex isn’t too complex so you can use things like an LRU cache of the compiled objects.</li>
<li>… It seems to me that there are harder things in the language to cache.</li>
</ul></li>
<li>JK: The motivating user story came from Liam Quin. Any word from him?</li>
<li>MK: I think he indicated that matching-substrings exceeded his requirements.</li>
<li>CG: I really like that function.</li>
<li>MK: What I’ll do is progress matching-substrings as a free standing function
and I’ll consider making fn:regex a separate proposal.</li>
<li>WP: Does this fall into a class of such problems that are solvable by record structures?</li>
<li>RD: The issue is caching the parsed regex object.</li>
</ul>
</div>
</div>
