meeting/minutes/2026/03-03.org
** PR #2481: 1528 ambiguities in computed node constructors
:PROPERTIES:
:CUSTOM_ID: pr-2481
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2481][#2481]]

+ MK: I think this is fairly straightforward. It reduces the number of keywords
  we reserve.
  + … The list basically includes all the spelled-out binary operators.
  + … It includes the leading keywords of clauses in flower expressions.
  + … And a couple of odd ones like ~case~ and ~else~ that are kind of pseudo-operators.
  + … Any keyword that can appear between two expressions becomes ambiguous.
+ RD: That’s because in those case the right hand side will be an empty map.
+ MK: Yes, the ~{~ introduces a map or empty constructor.

Proposal: accep this PR.

Accepted.

** PR #2483: 1479 XQuery: Default Namespace Clarifications
:PROPERTIES:
:CUSTOM_ID: pr-2483
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2483][#2483]]

+ MK: This ended up being a very simple editorial proposal. I was thinking of
  doing more but came to the conclusion that the text is largely there.
+ MK: Where we talk about namespace declaration attributes, it presents the
  rules in a more structured way. There aren’t any semantic changes.

Proposal: accept this PR.

Accepted.

** PR #2490: 2443 Naming: JNodes, selectors and contents
:PROPERTIES:
:CUSTOM_ID: pr-2490
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2490][#2490]]

CG outlines the issue.

+ CG: In discussion with users, it seems like JNodes are more complicated than they are.
  + … We can rename some of the functions to make them clearer.
+ RD: I like this. One of the advantages this has is that it reuses the names from maps.
+ JWL: Is there a mechanism in the system we have that allows me to move back up
  from an XNode up to the root and then further up into a map or array.
+ CG: Currently, no. The ancestors of XML nodes end at the XML root.
+ JWL: I’m thinking of the case where the value of an array is an XML tree.
  + … I’ll have to think about it.

Proposal: accept this PR.

Accepted.

** PR #2491: 2484 Subtyping: abstract types vs choice types
:PROPERTIES:
:CUSTOM_ID: pr-2491
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2491][#2491]]

MK introduces the PR.

+ MK: This recognizes that the type ~node~ is equivalent to a choice of one of
  the seven node kinds.
  + … It generalizes to the other choice item types.
+ MK: This picks up a few cases where it’s clearly equivalent and the subtyping
  rules now recognize that.
+ RD: In the data model spec where we have the hierarchy diagrams have we
  included JNode and GNode in those?
+ MK: Yes, that’s already done.
+ RD: And those reflect these changes?
+ MK: I’ve changed anyAtomicType into a square box to indicates it’s an abstract
  type.
 
MK reviews the diagram in the Data Model spec.

ACTION: QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!

Proposal: accept this PR.

Accepted.

** PR #2492: 2052 fn:collation-available: $usage
:PROPERTIES:
:CUSTOM_ID: pr-2492
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2492][#2492]]

+ CG: From the rules, it wasn’t clear to me what was supposed to be done with
  the ~$usage~ parameter.
+ RD: If you do specify a collation, it can be used anywhere?
+ MK: No, some can’t be used for substring matching for example.
+ RD: Isn’t that what ~$usage~ was for?
+ MK: Yes, but it’s not clear that things are as clear cut as the argument proposed.
+ RD: Would it then make sense to take a sequence of function references?
+ MK: But it’s used in other contexts too.

Proposal: accept this PR.

Accepted.

** PR #2474: 272 Allow xsl:use-package to set parameters
:PROPERTIES:
:CUSTOM_ID: pr-2474
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2474][#2474]]

+ MK: The problem here is “what exactly do package parameters mean, and when can you set them?”
  + … How do the answers impact what it means to pre-compile a package?
+ MK: We now allow ~xsl:with-param~ as a child of ~xsl:use-package~
+ MK: There’s a new section 3.4.4 Supplying Package Parameters
  + … Use package parameters must be known statically.
  + … One could generalize it to allow global variables, but I decided not to.
  + … It has to be a select attribute, not a sequence constructor
  + … It’s not an error to provide a parameter that isn’t used.
  + … You can set static or non-static parameters
    + … But observe that some values may already be fixed from some earlier part
      of the compilation; that raises an error.
+ MK: There’s an existing mechanism that you can override a parameter that’s still allowed.
+ MK: There’s a little extra text on ~xsl:expose~ to tidy up some issues with visibility.
+ JK: I like being able to control the parameters this way.
  + … Is it worth a note that this isn’t a “tunnel” parameter; they don’t go
    down to descendant packages.

ACTION: QT4CG-154-02: MK to add a note about “tunneling” package parameters.

+ JWL: Can you do anything with the override mechanism that you can’t do with
  the new functionality, or vice-versa?
+ MK: There were very old statements about whether stylesheet parameters were
  public or private. I’ve clarified that they’re private. That means you can’t
  override a parameter with a variable.
  + … What you can do, but isn’t very useful, is override a variable with a parameter.
  + … If the use-package declares a global variable, you can override it with a
    parameter that can be externally set.
+ JWL: It might be worth contrasting them in the spec.

Proposal: accept this PR.

Accepted.

** PR #2478: 2476 guaranteed streamability
:PROPERTIES:
:CUSTOM_ID: pr-2478
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2478][#2478]]

ACTION: QT4CG-154-03: NW to make sure that the streaming spec goes in the diff list

Leave this until that’s fixed.

** PR #2479: 2472 drop the term "potential visibility"
:PROPERTIES:
:CUSTOM_ID: pr-2479
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2479][#2479]]

+ MK: The term “potential visibility” was a hangover from an earlier draft.
  + … It was used in two places. It obviously meant “declared visibility” in the figure caption
  + … And it was used as a loose English adjective.

Proposal: accept this PR.

Accepted.

