meeting/minutes/2026/03-03.html
<div id="outline-container-pr-2481" class="outline-3">
<h3 id="pr-2481"><span class="section-number-3">2.3.</span> PR #2481: 1528 ambiguities in computed node constructors</h3>
<div class="outline-text-3" id="text-pr-2481">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2481">#2481</a>
</p>

<ul class="org-ul">
<li>MK: I think this is fairly straightforward. It reduces the number of keywords
we reserve.
<ul class="org-ul">
<li>… The list basically includes all the spelled-out binary operators.</li>
<li>… It includes the leading keywords of clauses in flower expressions.</li>
<li>… And a couple of odd ones like <code>case</code> and <code>else</code> that are kind of pseudo-operators.</li>
<li>… Any keyword that can appear between two expressions becomes ambiguous.</li>
</ul></li>
<li>RD: That’s because in those case the right hand side will be an empty map.</li>
<li>MK: Yes, the <code>{</code> introduces a map or empty constructor.</li>
</ul>

<p>
Proposal: accep this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2483" class="outline-3">
<h3 id="pr-2483"><span class="section-number-3">2.4.</span> PR #2483: 1479 XQuery: Default Namespace Clarifications</h3>
<div class="outline-text-3" id="text-pr-2483">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2483">#2483</a>
</p>

<ul class="org-ul">
<li>MK: This ended up being a very simple editorial proposal. I was thinking of
doing more but came to the conclusion that the text is largely there.</li>
<li>MK: Where we talk about namespace declaration attributes, it presents the
rules in a more structured way. There aren’t any semantic changes.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2490" class="outline-3">
<h3 id="pr-2490"><span class="section-number-3">2.5.</span> PR #2490: 2443 Naming: JNodes, selectors and contents</h3>
<div class="outline-text-3" id="text-pr-2490">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2490">#2490</a>
</p>

<p>
CG outlines the issue.
</p>

<ul class="org-ul">
<li>CG: In discussion with users, it seems like JNodes are more complicated than they are.
<ul class="org-ul">
<li>… We can rename some of the functions to make them clearer.</li>
</ul></li>
<li>RD: I like this. One of the advantages this has is that it reuses the names from maps.</li>
<li>JWL: Is there a mechanism in the system we have that allows me to move back up
from an XNode up to the root and then further up into a map or array.</li>
<li>CG: Currently, no. The ancestors of XML nodes end at the XML root.</li>
<li>JWL: I’m thinking of the case where the value of an array is an XML tree.
<ul class="org-ul">
<li>… I’ll have to think about it.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2491" class="outline-3">
<h3 id="pr-2491"><span class="section-number-3">2.6.</span> PR #2491: 2484 Subtyping: abstract types vs choice types</h3>
<div class="outline-text-3" id="text-pr-2491">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2491">#2491</a>
</p>

<p>
MK introduces the PR.
</p>

<ul class="org-ul">
<li>MK: This recognizes that the type <code>node</code> is equivalent to a choice of one of
the seven node kinds.
<ul class="org-ul">
<li>… It generalizes to the other choice item types.</li>
</ul></li>
<li>MK: This picks up a few cases where it’s clearly equivalent and the subtyping
rules now recognize that.</li>
<li>RD: In the data model spec where we have the hierarchy diagrams have we
included JNode and GNode in those?</li>
<li>MK: Yes, that’s already done.</li>
<li>RD: And those reflect these changes?</li>
<li>MK: I’ve changed anyAtomicType into a square box to indicates it’s an abstract
type.</li>
</ul>

<p>
MK reviews the diagram in the Data Model spec.
</p>

<p>
ACTION: QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!
</p>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2492" class="outline-3">
<h3 id="pr-2492"><span class="section-number-3">2.7.</span> PR #2492: 2052 fn:collation-available: $usage</h3>
<div class="outline-text-3" id="text-pr-2492">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2492">#2492</a>
</p>

<ul class="org-ul">
<li>CG: From the rules, it wasn’t clear to me what was supposed to be done with
the <code>$usage</code> parameter.</li>
<li>RD: If you do specify a collation, it can be used anywhere?</li>
<li>MK: No, some can’t be used for substring matching for example.</li>
<li>RD: Isn’t that what <code>$usage</code> was for?</li>
<li>MK: Yes, but it’s not clear that things are as clear cut as the argument proposed.</li>
<li>RD: Would it then make sense to take a sequence of function references?</li>
<li>MK: But it’s used in other contexts too.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2474" class="outline-3">
<h3 id="pr-2474"><span class="section-number-3">2.8.</span> PR #2474: 272 Allow xsl:use-package to set parameters</h3>
<div class="outline-text-3" id="text-pr-2474">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2474">#2474</a>
</p>

<ul class="org-ul">
<li>MK: The problem here is “what exactly do package parameters mean, and when can you set them?”
<ul class="org-ul">
<li>… How do the answers impact what it means to pre-compile a package?</li>
</ul></li>
<li>MK: We now allow <code>xsl:with-param</code> as a child of <code>xsl:use-package</code></li>
<li>MK: There’s a new section 3.4.4 Supplying Package Parameters
<ul class="org-ul">
<li>… Use package parameters must be known statically.</li>
<li>… One could generalize it to allow global variables, but I decided not to.</li>
<li>… It has to be a select attribute, not a sequence constructor</li>
<li>… It’s not an error to provide a parameter that isn’t used.</li>
<li>… You can set static or non-static parameters
<ul class="org-ul">
<li>… But observe that some values may already be fixed from some earlier part
of the compilation; that raises an error.</li>
</ul></li>
</ul></li>
<li>MK: There’s an existing mechanism that you can override a parameter that’s still allowed.</li>
<li>MK: There’s a little extra text on <code>xsl:expose</code> to tidy up some issues with visibility.</li>
<li>JK: I like being able to control the parameters this way.
<ul class="org-ul">
<li>… Is it worth a note that this isn’t a “tunnel” parameter; they don’t go
down to descendant packages.</li>
</ul></li>
</ul>

<p>
ACTION: QT4CG-154-02: MK to add a note about “tunneling” package parameters.
</p>

<ul class="org-ul">
<li>JWL: Can you do anything with the override mechanism that you can’t do with
the new functionality, or vice-versa?</li>
<li>MK: There were very old statements about whether stylesheet parameters were
public or private. I’ve clarified that they’re private. That means you can’t
override a parameter with a variable.
<ul class="org-ul">
<li>… What you can do, but isn’t very useful, is override a variable with a parameter.</li>
<li>… If the use-package declares a global variable, you can override it with a
parameter that can be externally set.</li>
</ul></li>
<li>JWL: It might be worth contrasting them in the spec.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2478" class="outline-3">
<h3 id="pr-2478"><span class="section-number-3">2.9.</span> PR #2478: 2476 guaranteed streamability</h3>
<div class="outline-text-3" id="text-pr-2478">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2478">#2478</a>
</p>

<p>
ACTION: QT4CG-154-03: NW to make sure that the streaming spec goes in the diff list
</p>

<p>
Leave this until that’s fixed.
</p>
</div>
</div>
<div id="outline-container-pr-2479" class="outline-3">
<h3 id="pr-2479"><span class="section-number-3">2.10.</span> PR #2479: 2472 drop the term "potential visibility"</h3>
<div class="outline-text-3" id="text-pr-2479">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2479">#2479</a>
</p>

<ul class="org-ul">
<li>MK: The term “potential visibility” was a hangover from an earlier draft.
<ul class="org-ul">
<li>… It was used in two places. It obviously meant “declared visibility” in the figure caption</li>
<li>… And it was used as a loose English adjective.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>
