meeting/minutes/2026/03-03.org
* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

Generators:

+ AP: DN would like to know what in his current spec needs to change to make it acceptable.
+ MK: My primary feeling is that the cost-benefit ratio is wrong; it’s too much
  extra functionality for the value that it delivers.
+ CG: That’s my impression too.
+ MK: That’s not to say it isn’t a useful feature; but as a value proposition, it’s too much effort.
  + … It’s reminded me of things we’ve done in the past that were a lot of work
    and not widely used. Like packages. The effort is disproportionate.
+ JK: I have no idea about the costs, but I do think it has a lot of benefit.
  + … I think it would work better as a separate spec.
+ NW: I think it would be good to ask DN what would prevent it from being a separate spec.

Default values:

+ CG: We could talk about the definition of default values.

CG shows the PR.

+ CG: The easy part was adding ~(:empty:)~. The hard part was to examine all the functions!
  + … I also clarified the rulesin some places, like ~fn:splice~.
+ MK: I think the main comment is that the word “empty” doesn’t immediately
  convey what it means. It sounds more like what the default is.
+ CG: I thought about “default-when-empty” but it’s better to have something short.
+ NW: I used the word “note” to try not having semantics.
+ RD: For a longer one, we could put it on a separate line.
+ MK: We could also put it more closely to the question mark that indicates it’s a default.

Some discussion of options: on-empty, when-empty, default-if-empty

+ CG: I also removed the rules about arguments with default values.
+ MK: I think it’s a good idea to make as much of the semantics declarative as we possibly can.
  + … The challenge is to combine that with readability.
+ RD: Would parameter based annotations help?
+ MK: Possibly…
+ CG: Some specifications like XQDoc rely on how we do annotations.

Revisit next time.
