meeting/minutes/2026/03-03.html
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
Generators:
</p>

<ul class="org-ul">
<li>AP: DN would like to know what in his current spec needs to change to make it acceptable.</li>
<li>MK: My primary feeling is that the cost-benefit ratio is wrong; it’s too much
extra functionality for the value that it delivers.</li>
<li>CG: That’s my impression too.</li>
<li>MK: That’s not to say it isn’t a useful feature; but as a value proposition, it’s too much effort.
<ul class="org-ul">
<li>… It’s reminded me of things we’ve done in the past that were a lot of work
and not widely used. Like packages. The effort is disproportionate.</li>
</ul></li>
<li>JK: I have no idea about the costs, but I do think it has a lot of benefit.
<ul class="org-ul">
<li>… I think it would work better as a separate spec.</li>
</ul></li>
<li>NW: I think it would be good to ask DN what would prevent it from being a separate spec.</li>
</ul>

<p>
Default values:
</p>

<ul class="org-ul">
<li>CG: We could talk about the definition of default values.</li>
</ul>

<p>
CG shows the PR.
</p>

<ul class="org-ul">
<li>CG: The easy part was adding <code>(:empty:)</code>. The hard part was to examine all the functions!
<ul class="org-ul">
<li>… I also clarified the rulesin some places, like <code>fn:splice</code>.</li>
</ul></li>
<li>MK: I think the main comment is that the word “empty” doesn’t immediately
convey what it means. It sounds more like what the default is.</li>
<li>CG: I thought about “default-when-empty” but it’s better to have something short.</li>
<li>NW: I used the word “note” to try not having semantics.</li>
<li>RD: For a longer one, we could put it on a separate line.</li>
<li>MK: We could also put it more closely to the question mark that indicates it’s a default.</li>
</ul>

<p>
Some discussion of options: on-empty, when-empty, default-if-empty
</p>

<ul class="org-ul">
<li>CG: I also removed the rules about arguments with default values.</li>
<li>MK: I think it’s a good idea to make as much of the semantics declarative as we possibly can.
<ul class="org-ul">
<li>… The challenge is to combine that with readability.</li>
</ul></li>
<li>RD: Would parameter based annotations help?</li>
<li>MK: Possibly…</li>
<li>CG: Some specifications like XQDoc rely on how we do annotations.</li>
</ul>

<p>
Revisit next time.
</p>
</div>
</div>
</div>
</body>
</html>
